ninjasstudio/micropython/ports/esp32/machine_pwm.c
        unsigned int res = 0;
        for (; i > 1; i >>= 1) {
            ++res;
        }

        // res = ledc_calc_duty_resolution(src_clk_freq, freq);

        if (res == 0) {
            res = 1;
        } else if (res > HIGHEST_PWM_RES) {
            // Limit resolution to HIGHEST_PWM_RES to match units of our duty
            res = HIGHEST_PWM_RES;
        }

        // Configure the new resolution and frequency
        timer->duty_resolution = res;
        timer->freq_hz = freq;
        timer->clk_cfg = LEDC_USE_APB_CLK;
        #if SOC_LEDC_SUPPORT_REF_TICK
        if (freq < EMPIRIC_FREQ) {
            timer->clk_cfg = LEDC_USE_REF_TICK;
        }
        #endif

        // Configure timer - Set frequency
        MP_PRN(3, " Configure timer - Set frequency: self->mode=%d, self->timer=%d, timer->freq_hz=%d", self->mode, self->timer, timer->freq_hz);
        check_esp_err(ledc_timer_config(timer));
        // Reset the timer if low speed
        if (self->mode == LEDC_LOW_SPEED_MODE) {
            check_esp_err(ledc_timer_rst(self->mode, self->timer));
        }

        // Save the same duty cycle when frequency is changed
        set_duty(self);
    }
}

STATIC bool is_free_channels(int mode, int pin) {
    MP_PRN(3, "is_free_channels(mode=%d, pin=%d)", mode, pin);
    for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
        if ((chans[mode][channel].pin < 0) || (chans[mode][channel].pin == pin)) {
            MP_PRN(3, " is_free_channels(mode=%d, pin=%d)->true", mode, pin);
            return true;
        }
    }
    MP_PRN(3, " is_free_channels()->false");
    return false;
}

// Find self channel or free channel in the mode
STATIC int find_channel(int mode, int pin) {
    MP_PRN(3, "find_channel(mode=%d, pin=%d)", mode, pin);
    int avail_channel = -1;
    for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
        if (chans[mode][channel].pin == pin) {
            MP_PRN(3, " find_channel(mode=%d, pin=%d)->channel=%d", mode, pin, channel);
            return channel;
        }
        if ((avail_channel < 0) && (chans[mode][channel].pin < 0)) {
            avail_channel = channel;
        }
    }
    MP_PRN(3, " find_channel(mode=%d, pin=%d)->avail_channel=%d", mode, pin, avail_channel);
    return avail_channel;
}

// Returns timer with the same mode and frequency, freq == 0 means free timer
STATIC int find_timer(int mode, unsigned int freq) {
    MP_PRN(3, "find_timer(mode=%d, freq=%d)", mode, freq);
    for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
        if (timers[mode][timer].freq_hz == freq) {
            MP_PRN(3, " find_timer(mode=%d, freq=%d)->timer=%d", mode, freq, timer);
            return timer;
        }
    }
    MP_PRN(3, " find_timer(mode=%d, freq=%d)->timer=-1", mode, freq);
    return -1;
}

// Try to find a timer with the same frequency in the current mode, otherwise in the next mode.
// If no existing timer and channel was found, then try to find free timer in any mode.
// If the mode or channel is changed, release the channel and select(bind) a new channel in the next mode.
STATIC void select_a_timer(machine_pwm_obj_t *self, int freq) {
    MP_PRN(2, "select_a_timer(freq=%d)", freq);
    if ((freq <= 0) || (freq > 40000000)) {
        mp_raise_ValueError(MP_ERROR_TEXT("frequency must be from 1Hz to 40MHz"));
    }

    // mode, channel, timer may be -1(not defined) or actual values
    int save_mode = self->mode;
    int save_channel = self->channel;
    // int save_timer = self->timer;

    int mode = MAX(self->mode, 0);

    // Check if an already running timer with the required frequency is running in the current mode
    int timer = -1;
    if (is_free_channels(mode, self->pin)) {
        timer = find_timer(mode, freq);
    }
    // If no existing timer and channel was found in the current mode, then find a new one in another mode
    if (timer < 0) {
        // Calc next mode
        int mode_ = mode;
        if (mode > 0) {
            --mode;
        } else if (mode < (LEDC_SPEED_MODE_MAX - 1)) {
            ++mode;
        }

        if (mode_ != mode) {
            if (is_free_channels(mode, self->pin)) {
                timer = find_timer(mode, freq);
            }
        }
    }
    // If the timer is found, then bind and set the duty
    if ((timer >= 0)
    && (timers[mode][timer].freq_hz != 0)
    && (timers[mode][timer].freq_hz != freq)
    && (self->channel >= 0)
    && (self->mode >= 0)) {
        // Bind the channel to the timer
        self->mode = mode;
        self->timer = timer;
        check_esp_err(ledc_bind_channel_timer(self->mode, self->channel, self->timer));
        register_channel(self->mode, self->channel, self->pin, self->timer);
        set_duty(self);
    } else {
        timer = -1;
    }

    if (timer < 0) {
        // Try to reuse self timer
        MP_PRN(2, " Try to reuse self timer:self->mode=%d, self->timer=%d, self->channel=%d, self->pin=%d", self->mode, self->timer, self->channel, self->pin);
        if ((self->mode >= 0) && (self->channel >= 0)) {
            if (!is_timer_in_use(self->mode, self->channel, self->timer)) {
                mode = self->mode;
                timer = self->timer;
            }
        }
        MP_PRN(2, " Try to reuse self timer:mode=%d, timer=%d", mode, timer);
        // If no existing timer and channel was found, then try to find free timer in any mode
        if (timer < 0) {
            mode = -1;
            while ((timer < 0) && (mode < (LEDC_SPEED_MODE_MAX - 1))) {
                ++mode;
                if (is_free_channels(mode, self->pin)) {
                    timer = find_timer(mode, 0); // find free timer
                }
            }
            if (timer < 0) {
                mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM timers:%d"), LEDC_SPEED_MODE_MAX * LEDC_TIMER_MAX);
            }
        }
        self->mode = mode;
        self->timer = timer;
    }
    if ((save_mode != self->mode) || (save_channel != self->channel)) {
        unregister_channel(save_mode, save_channel);
    }
}

/******************************************************************************/
// MicroPython bindings for PWM

